Catalogs/DMS_КарточкиКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_КарточкиКлиентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ВидыКарточекКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПоКарте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_УсловияПоКарточкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекретныйКодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОформления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодРождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаГарантии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТоплива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДилера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМодели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКем</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКогда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияГарантии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияГарантииРасширенная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/DMS_УсловияПоКарточкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_УсловияПоКарточкам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.DMS_ВидыКарточекКлиента</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОграничениеПоСроку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеПоПробегу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМодели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>До3хМесяцев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_КарточкиКлиентов/Forms/ФормаОформленияКарты/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийЭтап = 1;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьVINНаСервере(VIN,Сообщение)
	
		Попытка
			ВебСервис = Справочники.DMS_КарточкиКлиентов.ПолучитьВебСервис();
		Исключение
			Сообщить("Не удалось соединиться с центральной базой!");
			Сообщить("Ошибка " +ОписаниеОшибки());
			Возврат 0;
		КонецПопытки;
		
		
		КодМодели = ВебСервис.CheckVin(VIN,Сообщение);
		Если КодМодели = "0" тогда
			Возврат 0;
		иначе		
			Возврат Число(КодМодели);
			//Сообщить(Сообщение+ " "+ "Код модели " + КодМодели);
		КонецЕсли;
	
	КонецФункции
	
&НаСервереБезКонтекста
Функция ПроверитьКартуНаСервере(НомерКарты,КодКарты)
	
	Попытка
		ВебСервис = Справочники.DMS_КарточкиКлиентов.ПолучитьВебСервис();
	Исключение
		Возврат -1;
	КонецПопытки;
	
	Возврат ВебСервис.CheckCard(СокрЛп(НомерКарты),СокрЛП(КодКарты));
	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьДанныеВладельца(Автомобиль);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиСрезПоследних.Значение
		|ИЗ
		|	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
		|ГДЕ
		|	АвтомобилиСрезПоследних.Автомобиль = &Автомобиль
		|	И АвтомобилиСрезПоследних.ВидЗначения = &ВидЗначения";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураДанных = Новый Структура;
	
	Если Выборка.Следующий() тогда
		Клиент = Выборка.Значение;
		
		СтруктураДанных.Вставить("Клиент",Клиент);
	    СтруктураДанных.Вставить("Фамилия",Клиент.Фамилия);
		СтруктураДанных.Вставить("Имя",Клиент.Имя);
		СтруктураДанных.Вставить("Отчество",Клиент.Отчество);
		СтруктураДанных.Вставить("Документ", Справочники.DMS_КарточкиКлиентов.ВернутьДокументКлиента(Клиент));
		СтруктураДанных.Вставить("АдресРегистрации",Справочники.DMS_КарточкиКлиентов.ВернутьАдрес(Клиент));
		СтруктураДанных.Вставить("Телефон",Справочники.DMS_КарточкиКлиентов.ВернутьТелефон(Клиент));
		СтруктураДанных.Вставить("ГодРождения",Год(Клиент.ДатаРождения));
		СтруктураДанных.Вставить("eMail","e-mail");
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
	
КонецФункции

&НаКлиенте
Процедура ЗагрузкаУсловийПоКартам()
	ЗагрузитьУсловияПоКартам();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьУсловияПоКартам()
	
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("id");
	ТаблицаДанных.Колонки.Добавить("model_id");
	ТаблицаДанных.Колонки.Добавить("Price");
	ТаблицаДанных.Колонки.Добавить("MileageLimit");
	ТаблицаДанных.Колонки.Добавить("TimeLimit");
	ТаблицаДанных.Колонки.Добавить("Code");	
	ТаблицаДанных.Колонки.Добавить("Active");	
	ТаблицаДанных.Колонки.Добавить("do3mes");
	
	
	Попытка
		ВебСервис = Справочники.DMS_КарточкиКлиентов.ПолучитьВебСервис();
	Исключение
		Сообщить("Не удалось соединиться с центральной базой!");
		Сообщить("Ошибка " +ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ПакетДанных = ВебСервис.GetContracts();
	ТаблицаДанных = СериализаторXDTO.ПрочитатьXDTO(ПакетДанных);
	
	Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") тогда
		Для каждого стр из ТаблицаДанных цикл
			
			Условие = Справочники.DMS_УсловияПоКарточкам.НайтиПоКоду(стр.id).Ссылка;
			
			Если Условие = Справочники.DMS_УсловияПоКарточкам.ПустаяСсылка() тогда
				УсловиеОбъект = Справочники.DMS_УсловияПоКарточкам.СоздатьЭлемент();
			иначе
				УсловиеОбъект = Условие.ПолучитьОбъект();
			КонецЕсли;
			УсловиеОбъект.Код = стр.id;
			УсловиеОбъект.Владелец = Справочники.DMS_ВидыКарточекКлиента.ПродленнаяГарантия;
			УсловиеОбъект.Наименование = Стр.Code;
			УсловиеОбъект.ОграничениеПоСроку = стр.TimeLimit;
			УсловиеОбъект.ОграничениеПоПробегу = стр.MileageLimit;
			УсловиеОбъект.Цена = Стр.Price;
			УсловиеОбъект.До3хМесяцев = ?(Стр.do3mes = 1, Истина, Ложь);
			Если ТекущаяДата() >= '20190101' Тогда
				УсловиеОбъект.НДС = Стр.Price * 0.20;
			Иначе
				УсловиеОбъект.НДС = Стр.Price * 0.18;
			КонецЕсли;
			УсловиеОбъект.КодМодели = стр.model_id;
			УсловиеОбъект.Активно = ?(стр.Active = 1,Истина,Ложь);
			УсловиеОбъект.Записать();
			
		КонецЦикла;
		
	Иначе 
		Сообщить("Ошибка, данные от сервера не получены!");
	КонецЕсли;

	
КонецПроцедуры



&НаКлиенте
Процедура ПерейтиНаСледующийЭтап(Команда)
	Если ЭтаФорма.ТекущийЭтап = 1 тогда
		Сообщение ="";	
		КодМодели = ПроверитьVINНаСервере(VIN,Сообщение);
		ЭтаФорма.ВариантыУсловииПоКарте.Параметры.УстановитьЗначениеПараметра("КодМодели",КодМодели);
		
		Если КодМодели <> 0 тогда
			ЭтаФорма.Элементы.ГруппаЭтап1.Видимость = Ложь;
			ЭтаФорма.Элементы.ГруппаЭтап2.Видимость = Истина;
			ЭтаФорма.ТекущийЭтап = 2;
			
		Иначе
			Сообщить(Сообщение);
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма.ТекущийЭтап = 2 тогда
		
		УсловияПоКарте = ЭтаФорма.Элементы.ВариантыУсловииПоКарте.ТекущаяСтрока;
		ЭтаФорма.Элементы.ГруппаЭтап2.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаЭтап3.Видимость = Истина;
		ЭтаФорма.ТекущийЭтап = 3;
	ИначеЕсли ЭтаФорма.ТекущийЭтап = 3 тогда
		ЭтаФорма.Элементы.ГруппаЭтап3.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаЭтап4.Видимость = Истина;
		ЭтаФорма.ТекущийЭтап = 4;
	ИначеЕсли ЭтаФорма.ТекущийЭтап = 4 тогда
		
		//Вызов веб сервиса проверки карты
		КодДилера = ПроверитьКартуНаСервере(НомерКарты,СекретныйКодКарты);
		
		Если КодДилера = 0 тогда
			
			Сообщить("Карта недоступна для выдачи");
			Возврат;
		ИначеЕсли КодДилера = -1 тогда
				Сообщить("Не удалось соединиться с центральной базой! Попробуйте повторить попытку проверки!");
				Возврат;
		КонецЕсли;	
		
		ЭтаФорма.Элементы.ГруппаЭтап4.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаЭтап5.Видимость = Истина;
		ЭтаФорма.Элементы.ПерейтиНаСледующийЭтап.Заголовок ="Завершить";
		ЭтаФорма.ТекущийЭтап = 5;
	ИначеЕсли ЭтаФорма.ТекущийЭтап = 5 тогда
		//Отправить данные через веб-сервис на сервер и закрыть форму.
		Закрыть();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаПредыдущийЭтап(Команда)
	
	Если ЭтаФорма.ТекущийЭтап = 1 тогда
		Возврат;
	ИначеЕсли ЭтаФорма.ТекущийЭтап = 2 тогда
		ЭтаФорма.Элементы.ГруппаЭтап2.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаЭтап1.Видимость = Истина;
		ЭтаФорма.ТекущийЭтап = 1
	ИначеЕсли ЭтаФорма.ТекущийЭтап = 3 тогда
		ЭтаФорма.Элементы.ГруппаЭтап3.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаЭтап2.Видимость = Истина;
		ЭтаФорма.ТекущийЭтап = 2;
	ИначеЕсли ЭтаФорма.ТекущийЭтап = 4 тогда
		ЭтаФорма.Элементы.ГруппаЭтап4.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаЭтап3.Видимость = Истина;
		ЭтаФорма.ТекущийЭтап = 3;
	ИначеЕсли ЭтаФорма.ТекущийЭтап = 5 тогда
		ЭтаФорма.Элементы.ГруппаЭтап5.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаЭтап4.Видимость = Истина;
		ЭтаФорма.ТекущийЭтап = 4;
		ЭтаФорма.Элементы.ПерейтиНаСледующийЭтап.Заголовок ="Далее";
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура VINПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекстРедактирования) тогда
		Возврат;
	КонецЕсли;
	
	Автомобиль = НайтиАвтоПоVIN(Элемент.ТекстРедактирования);
	ЭтаФорма.Элементы.ОткрытьКарточкуАвто.Доступность = Автомобиль <> Справочники.Автомобили.ПустаяСсылка();
	Если Автомобиль <> Справочники.Автомобили.ПустаяСсылка() тогда
		ДатаНачалаГарантии = Автомобиль.ДатаНачалаГарантии;
		ЭтаФорма.Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);	
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ПолучитьДанныеВладельца(Автомобиль));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиАвтоПоVIN(VIN)
	
	
	Возврат Справочники.Автомобили.НайтиПоРеквизиту("VIN",VIN).Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьКарточкуАвто(Команда)
	
	ОткрытьЗначение(Автомобиль);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидТоплива = "gasoline";
	ЭтаФорма.Элементы.ОткрытьКарточкуАвто.Доступность = Ложь;
	ЭтаФорма.Элементы.ГруппаЭтап1.Видимость = Истина;
	ВидКарты = Справочники.DMS_ВидыКарточекКлиента.ПродленнаяГарантия;
	ЭтаФорма.ВариантыУсловииПоКарте.Параметры.УстановитьЗначениеПараметра("ВидКарты",ВидКарты);
	ЭтаФорма.ВариантыУсловииПоКарте.Параметры.УстановитьЗначениеПараметра("КодМодели",0);
	ПодключитьОбработчикОжидания("ЗагрузкаУсловийПоКартам",0.1 ,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКартыПриИзменении(Элемент)
	
	ЭтаФорма.ВариантыУсловииПоКарте.Параметры.УстановитьЗначениеПараметра("ВидКарты",ВидКарты);
	
КонецПроцедуры


&НаСервере
Процедура ЗаписатьКартуНаСервере()
	
	Если КарточкаКлиента = Справочники.DMS_КарточкиКлиентов.ПустаяСсылка() тогда
		Элемент = Справочники.DMS_КарточкиКлиентов.СоздатьЭлемент();	
		ЗаполнитьЗначенияСвойств(Элемент,ЭтаФорма);
		Элемент.Наименование = ЭтаФорма.НомерДоговора;
		Элемент.ДатаОкончанияГарантии = ДобавитьМесяц(ЭтаФорма.ДатаНачалаГарантии, 36);
		Элемент.ДатаОкончанияГарантииРасширенная = ДобавитьМесяц(ЭтаФорма.ДатаНачалаГарантии, УсловияПоКарте.ОграничениеПоСроку * 12);
		Элемент.ДатаОкончания = ДобавитьМесяц(ЭтаФорма.ДатаНачалаГарантии, УсловияПоКарте.ОграничениеПоСроку * 12);
		Элемент.Записать();
		КарточкаКлиента = Элемент.Ссылка;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьКарточку(Команда)
	
	Если ЗначениеЗаполнено(НомерДоговора) и ЗначениеЗаполнено(ДатаОформления) тогда
		
		ЗаписатьКартуНаСервере();
		
		РезультатЗаписи = Справочники.DMS_КарточкиКлиентов.ЗаписатьПродажуКартыВБазуSQL(КарточкаКлиента);
		
		Если РезультатЗаписи.Ответ = 1 тогда
			ЭтаФорма.Элементы.ЗаписатьКарточку.Доступность = Ложь;
			ЭтаФорма.Элементы.СправочникDMS_КарточкиКлиентовПечатьАктУпр.Доступность = Истина;
			ЭтаФорма.Элементы.СправочникDMS_КарточкиКлиентовПечатьДоговорУпр.Доступность = Истина;
		Иначе
			Сообщить(РезультатЗаписи.Сообщение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
